ir_version: 2
producer_name: "pytorch"
producer_version: "0.3"
graph {
  node {
    input: "1"
    input: "0"
    output: "2"
    op_type: "Gather"
  }
  name: "torch-jit-export"
  initializer {
    dims: 4
    dims: 3
    data_type: FLOAT
    name: "1"
    raw_data: "\224t\367\276\245Y\010\275\214{Y\277Lk8\277\2011\345\277\275\316\234\277\245\204&@\3408\261?Q\340\367\275\242E\036\300\224\232\352=7\314\001?"
  }
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: INT64
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 2
}
