ir_version: 2
producer_name: "pytorch"
producer_version: "0.3"
graph {
  node {
    input: "0"
    output: "1"
    output: "2"
    op_type: "Split"
    attribute {
      name: "axis"
      i: -1
      type: INT
    }
  }
  node {
    input: "2"
    output: "3"
    op_type: "Sigmoid"
  }
  node {
    input: "1"
    input: "3"
    output: "4"
    op_type: "Mul"
  }
  name: "torch-jit-export"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
  output {
    name: "4"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 2
}
