ir_version: 2
producer_name: "pytorch"
producer_version: "0.3"
graph {
  node {
    input: "1"
    input: "0"
    output: "2"
    op_type: "Gather"
  }
  name: "torch-jit-export"
  initializer {
    dims: 4
    dims: 3
    data_type: FLOAT
    name: "1"
    raw_data: "u\327\240<\301\n\246\276\312rb?\364(\201\276\335\031\004?\203\272\312>\300e>\277\006w7\277\343O\006=h\362\t?\342\033\022\276\211\375\262?"
  }
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: INT64
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 2
}
