ir_version: 2
producer_name: "pytorch"
producer_version: "0.3"
graph {
  node {
    input: "0"
    input: "1"
    output: "3"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 4
      type: INT
    }
  }
  node {
    input: "3"
    input: "2"
    output: "4"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
      type: INT
    }
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 4
    dims: 1
    dims: 3
    dims: 3
    data_type: FLOAT
    name: "1"
    raw_data: "*\007\342=\\^m\275p\252O<\360\346\215\275\026\013\364=\220\224\001\275\220\247\375\275W\225\025>\260\216(\276p!G=c\340\362\275\254Y\016\276`\'\037=\302f\277=/\376\002>\331\006\031>\006Y\336\275\330\350\225\275\2647_=\212Y\244=\233z$\276\262\332\322=\354\332\024=\262\357\231=h\302\006\276\322\203\253=|\330w=\220\016\362\275\260\3760\274>Q\346=\034\360\002\275\364\350Z=(\246\226=\352-\364=\226\305\326\275\273%!>"
  }
  initializer {
    dims: 4
    data_type: FLOAT
    name: "2"
    raw_data: "\226\226\277\275\300\327\206=\226\214\373\275:\207\300="
  }
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "2"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "4"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
}
opset_import {
  version: 2
}
