ir_version: 2
producer_name: "pytorch"
producer_version: "0.3"
graph {
  node {
    input: "0"
    input: "1"
    input: "2"
    input: "3"
    input: "4"
    output: "5"
    op_type: "BatchNormalization"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 0.0010000000475
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.20000000298
      type: FLOAT
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 3
    data_type: FLOAT
    name: "1"
    raw_data: "\000\034e<Az\n?\327\3156?"
  }
  initializer {
    dims: 3
    data_type: FLOAT
    name: "2"
    raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 3
    data_type: FLOAT
    name: "3"
    raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 3
    data_type: FLOAT
    name: "4"
    raw_data: "\000\000\200?\000\000\200?\000\000\200?"
  }
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "2"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "3"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "4"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "5"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
}
opset_import {
  version: 2
}
