ir_version: 2
producer_name: "pytorch"
producer_version: "0.3"
graph {
  node {
    input: "0"
    output: "1"
    op_type: "Upsample"
    attribute {
      name: "height_scale"
      f: 4.0
      type: FLOAT
    }
    attribute {
      name: "mode"
      s: "nearest"
      type: STRING
    }
    attribute {
      name: "width_scale"
      f: 4.0
      type: FLOAT
    }
  }
  name: "torch-jit-export"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 16
          }
        }
      }
    }
  }
}
opset_import {
  version: 2
}
