ir_version: 2
producer_name: "pytorch"
producer_version: "0.3"
graph {
  node {
    input: "0"
    input: "1"
    output: "3"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "dilations"
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
  }
  node {
    input: "3"
    input: "2"
    output: "4"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
      type: INT
    }
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 4
    dims: 3
    dims: 2
    dims: 2
    dims: 2
    data_type: FLOAT
    name: "1"
    raw_data: "m\2742\276@\304\013>t\2348>Z\376\025>\366XK>x\341\364=\277\021\326\275\340\226\344\274\312\277\023>shH\276p$\030\274\344\247&>\324:\243=\360\257+\276\264\232/=\270\261[=\264\363\007>\330\213M>pg\362<\361\2703\276`\326l=\272R\'\276\004\3101>\0003D\274\364\257\025=\266C\020>*+6>V\347\036\276<ZV\275\226\337\275\275\205\035 \276\260$1>A5:\276|\345U\275cm\261\275X\367/=\260\\\031>\"\237\307\275m\377\366\275\310\301\320=@rB\276`\356\371=\270\317\262<\340J\343<X\321\017=\312\334\033>\350\316%>P\242\212\274\272\335\025\276x\310\\\275\336\031\375\275\244\036\013=@,\220=\3144E\275\270sN\276\306\205\270\275\336\367B>\022E&>H\310\243=P$[\275;\373\336\275\304\013<\275\034\323\360\2754\327.\275\304\301\023>\265\352\377\275\354X\365=\276YI\276\221W<\276|\375)\276\2302Q\275\r\225\315\275\014\271}\275,\250\373\275\232\334\213\275\240N\203=S\355\376\275\204h&>\210\006\200=3\021\365\275h\203L>< \322=\320\200\330=p\327\275=H\334\331\274\360\342P>\234&\026>\324\020\037=\370\205\324=\234\213\311=\034\245\252=\336\272\017>\256A\215\2752<\035>H\242\200=-\201\320\275"
  }
  initializer {
    dims: 4
    data_type: FLOAT
    name: "2"
    raw_data: "\270\241\031=\234\312;\275\364\2553=X\342\221="
  }
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "2"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "4"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 2
}
