ir_version: 2
producer_name: "pytorch"
producer_version: "0.3"
graph {
  node {
    output: "9"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        dims: 3
        dims: 20
        data_type: FLOAT
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "10"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: INT32
        raw_data: "\005\000\000\000\005\000\000\000\005\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "1"
    output: "11"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "1"
    output: "12"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 80
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 60
      type: INTS
    }
  }
  node {
    input: "1"
    output: "13"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 60
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 20
      type: INTS
    }
  }
  node {
    input: "11"
    input: "12"
    input: "13"
    output: "14"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "2"
    output: "15"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "2"
    output: "16"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 80
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 60
      type: INTS
    }
  }
  node {
    input: "2"
    output: "17"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 60
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 20
      type: INTS
    }
  }
  node {
    input: "15"
    input: "16"
    input: "17"
    output: "18"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "3"
    output: "19"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "3"
    output: "20"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 80
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 60
      type: INTS
    }
  }
  node {
    input: "3"
    output: "21"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 60
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 20
      type: INTS
    }
  }
  node {
    input: "19"
    input: "20"
    input: "21"
    output: "22"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "4"
    output: "23"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "4"
    output: "24"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 80
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 60
      type: INTS
    }
  }
  node {
    input: "4"
    output: "25"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 60
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 20
      type: INTS
    }
  }
  node {
    input: "23"
    input: "24"
    input: "25"
    output: "26"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "22"
    input: "26"
    output: "27"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "9"
    output: "28"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 1
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "9"
    output: "29"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 1
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "0"
    input: "14"
    input: "18"
    input: "27"
    input: "10"
    input: "28"
    input: "29"
    output: "30"
    output: "31"
    op_type: "LSTM"
    attribute {
      name: "hidden_size"
      i: 20
      type: INT
    }
  }
  node {
    input: "5"
    output: "32"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "5"
    output: "33"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 80
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 60
      type: INTS
    }
  }
  node {
    input: "5"
    output: "34"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 60
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 20
      type: INTS
    }
  }
  node {
    input: "32"
    input: "33"
    input: "34"
    output: "35"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "6"
    output: "36"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "6"
    output: "37"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 80
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 60
      type: INTS
    }
  }
  node {
    input: "6"
    output: "38"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 60
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 20
      type: INTS
    }
  }
  node {
    input: "36"
    input: "37"
    input: "38"
    output: "39"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "7"
    output: "40"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "7"
    output: "41"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 80
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 60
      type: INTS
    }
  }
  node {
    input: "7"
    output: "42"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 60
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 20
      type: INTS
    }
  }
  node {
    input: "40"
    input: "41"
    input: "42"
    output: "43"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "8"
    output: "44"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "8"
    output: "45"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 80
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 60
      type: INTS
    }
  }
  node {
    input: "8"
    output: "46"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 60
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 20
      type: INTS
    }
  }
  node {
    input: "44"
    input: "45"
    input: "46"
    output: "47"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "43"
    input: "47"
    output: "48"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "9"
    output: "49"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 2
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 1
      type: INTS
    }
  }
  node {
    input: "9"
    output: "50"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 2
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 1
      type: INTS
    }
  }
  node {
    input: "30"
    input: "35"
    input: "39"
    input: "48"
    input: "10"
    input: "49"
    input: "50"
    output: "51"
    output: "52"
    op_type: "LSTM"
    attribute {
      name: "hidden_size"
      i: 20
      type: INT
    }
  }
  node {
    input: "31"
    input: "52"
    output: "53"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 80
    dims: 10
    data_type: FLOAT
    name: "1"
    raw_data: "`\275\272\275`\265\362;sq\343\275\254\262\254=\021\031C\276\370\330\'>Tm&\276\036\0136\276p\257\020\276\254f\317=.5\251\275\250^\253=\037VB\276n\354\n\276\246%\250\275\274\3753\275\346\254.\276\374\355\025>\010\377W\275\310\376\222=\302\352!>\360\242*=\250sz=\276\004]>\314\211\316\275 \016\221=u\277\313\275\300\242#>\376\3366>j\033S\276PvC>\030\255\332=\340\216\307=p\206\274=hX>>H\336\361\274v\244A\276Fh\203\275\230B!\276\320/r<\020\001+\275\277\242\365\275p\214\246\274$\356X>\240{\220\274@\243\350;\340\327\016\275 \374\017=\246\004L>\374\003\014>\260\215\242=\210\010G=\020\366W=\210\353\260=\270\265\354\274R\317T\276\220\231\r\276\312rC>\000\374Z<9|9\276(v\020=\2661=>8aX\276d\'\032\276jb\266\275\000\014\023<\000\235U\275\030L\311\274O9_\276hr\326=\326\372H>\022\365\013>\271$\"\276\201\2238\276\330)\276=\240\216\244;\374\271\273=\334\275_\276\360nZ\274f{!>\\r\324=\300\310\005<\000\0254=\010o\255\274b\313\373\275\310\016\255\275\254p\013\276\370/>>\200\000\374=\200\'\240=\273\226/\276L\2560>\374\225\217=\014g\036>\324&\264\275\250*B=\310\220_>b\005\032>\310\2427>\334R@\275\030s.>\335V3\276\350m\236<\261\354\000\276\254\231U\275\330\216j\275x\r\211<\322eP>\330\270\342=\000Qx\272$\211\">g\255\352\275<\003\354=\320\335\251\274\034`\037\275\030t\326<nj/\276(\255\323<\250\372\231=\260\301C>\034\224\216\275\230\337\244=\224\334d>\350q\304\275\014\251Y>\355]\343\275P\334\311=\224f\263=\270\325\177=\246\0225>\366\025\271\275\330\266p=\000|\244:k8,\276Hd^\275\350\351\030\276\314{\312=\230\253\244<Hs\263<x\355\212\275\200\356\214:\362p\216\275\254\225\203=:_^>\030\273\n=>\325\312\275\004\335\013\276 \005\214<\357\334)\276\236\033,\276\223\010\025\276\n\212\233\275\230\225\207<x\254\035>|a\261=\270k/>\223\305\017\276\300\224\232<\256\207K\276*Z\003>\230\341>=fw]>@\331\"\276\336\2367>,NA>\006!9>x\261\002=d3P>\232\352\030>\020\325*> \375m\274\267\266/\276\300[6\273\330\303+=5\370\033\276\034Y\003\276\003\207[\2764\210\240\275\224sG>8\235\034=\200\305_\2740\037\023<|\306\016>\2622J\276h\2540\276\364@\230\275@\307\003\276\2743\354=\356\311!>\347\'^\2765SB\276t\372^\2760\303\254=NJ8>@\2101\276f\002\324\275d\272\221=(\204\025\276\030\202B>\000\215U=@\370~\275\200\363m<\374\305\216=\234\357\241\275\335k1\276\200\000\305:\240v\205;\340\300\223;\030\250\005\275\212\004\023>\244\226\177\275\270M\261\274TM\274=\330\037\020\276\010=u=\270\204J\2758\252\333=wk\370\275Pf\007<\3303\263<.;8\276\006\177&\276\360\240\257=\322I\205\275\214\374\007>\2701b\276M`\342\275\275\230<\276\310\357\266=\200l\324\273p\325*\275\340`\030\275\016\3722\276\024\337\201=\240\242\266;z\004\036\276\330Q\254=\300D\223\273ws]\276\274V\366=$\363\364=L\220,\275\212\027\036\276\300\027\023<V\307,>\244\226Q>O\324,\276 \327\316\275\304H2>\234\325\337=\314\274\r>\220\357\343\275\270DE>0;<\276`x0\274\000\"\230;0\327\031=\225\307,\276J\023R>d\007a>v!\036\276\340U\007<N\356\363\275\034\217[>\224a\377=\262\327\006>X\274\223=\350]\266\274\"\355\000>@\211y;(\005\247\275\020q\354=\340\264\217=HRm\275\224\001{\275~}J\2764\020{\275L\205\271\275s\232\371\275\035\320N\276pY3>\256\241L\276 Nc>\0304\360\275\340\315\214\274\200\310:>\364\024\227=T\276\202\275+V8\276\344;\273\275\306d8>\326\354\254\275\310\324>>d\273\035\275@\235\351\274\254\305\266=|\223\006\275\200\323\366\272\332\225\036>\210\013\231=\240\323\021\274Df\256=FlG>\220\327f=:K\206\275T\016\226=\030C\240\274Q\0043\276\210\323\260\275\310G\320=\200I\360;\364\364\250=\356\004\006\276\350tX>\212\034\277\275XRC=_\304\337\275\327\341\334\275\000\032\315=\350\251\177\275\0229\021\276\344.\273\275\260\367&>\234\325\t>\212`\013>\202kC\276\000\251\327=\230\251d=s\366\031\276\340\235\347;p(7=\334e\367\275FB\301\275t\305:>\260\375\223\274\300\306\032\273\224\352\020\276\332\352\010\276\252\317R>\324m\252=\374\366\020\275\274}\013>4\334\331\275B\275G\276\264Rc\276\350\022\272=6\215\262\275\036\232\014>\370\233C>\230\340\226=\202\272D>\024\366R\275`\207G>?\\\332\2758a\360\274\322+\030>\343B\355\275\234\270.>\350~`= \211\217\273F\365C>X\301+>\272Z\274\275P\254\261<0|\325<\204\216;>r\251\000>\304f9>(\227\013>^<G\276\006\037\030>\3446s\275\332\2647>\016\026\020>!\327\005\276@\317\300\274\250\264\010=\270\340\202= \021T\276\320\347#<\270\230\356=tB\001>D@\341=\320\323\020=`\244[\276p\250\026>XL4\276\n\221\006\276\300p+;<p\213=\220\007\005>\234\237\000\275\275\257\353\275\320\262\235\274\030\021\226=F\320\000\276\222\337F\276\030\244\332=\'\207\027\276\021\336\000\276\226\364=>8\341\026\276\351\3169\276\026\t.>\330\206\332\2750\322m<\\\032d>\366\274\266\275HFU>\210\3535>\232\3300>\370\324\207=\351j\316\275p*\020>\003\326\034\276yf\005\276\025\301\334\275\214\017\306=\340J\374<\n\256\021>\262}\026>\000\355U<\260w\005>\202z%\276\316\326Z\276\025\213:\276|\265\374=\000\213R>`K}\275\014_\375=\272\234#\276\200F\212\273\200\320\260\272\244\223\204\275P\372\335\275\210\330\326=8\217\237\274\240\2045\275\226\022\037>\304\341-\276\210\206\025>\354ZK>l\252\014\276\265\363X\276\360\316\376<\357&.\276\334}\277=.\2356\276\226\2662\276\000\302w=\010\270j\275\236\256J\276$\260\262=8\302\241=0\333\366<6\237\025>x\335\267\275~\375P>Q\203.\276\226uN>t#*>s\256K\276\370\264\242\274\270Z\366\275\200La>\240\331\030\274\264\337\006>\302\365E>\273\2200\276\3440\013>\305-G\276t[w\2750\247\270\275 \'V\276r\254W\276\344\301\\\276Q\0361\276\"\343\377\275z\361\226\275\026\033\000>(;\023\275\335\264b\276nQ&\276\224S$>\024n_\2762@\341\275\0359O\276\224d\366= \203\034>\320I\240<\2217\346\275x\013^\275@\211U<<\354\277=\300%};5\204\325\275\300x1<\340w\340;\300\227\010;\3240\307=x\226\254\275\000\276f<\000\356y:$T\301=h*\014\276\216\0033\276\360Z:\276\334e\300=|)6>L\033c>\244\206\243=$\273:\275\020\262(=Lmb\276\320w\323<\374*\227\275(\017\213\274\366\205\003>X\242\235\275\243q-\276\260K]<P\014\177\275i\212\325\275\274\341\213\275.\322\001\276\222\373H> \335{<\013\014\363\275B\376\021>\340\255\r=\036t\003>\264\2040>`Jb>\220Nm\275 <\331;\323\255\004\276\244\351P>\374\301\221=,\242\027\275@\204e=\2220c>\370x\272=\350l\336=>gS>P\220\034<\200\207\214:\300Qc=\371\236S\276\320\033\240=\200m\334\272ps/\274\340\277R<T\320J>\230i\203=zoO\276f T>\376\243\013>\354\030\347=,\372\274=\340\251\262<\355\332\374\275<\305\022>h\032+\276\310y\n\276\000Z\023:\020\2501\276@\270O>\002|c>\2108\344=\014\303\013>\230\314]\276\254\235E>\370\331 =\002\237\020\276\226\346\037\276`\302\\=V\004\n>D`u\275<\223^\275\374\3710\275\2358V\276\236\275$>\300\207\235\274[\034R\276\251\247+\276H\237\217=\222\013\\\276\300B!>t\030=\276\340<\372\2730\007\207=\'\355\327\275n\254\024\276\320\361\301\274\230\356$=\304\340\"\275\014m\315=d\307\357=\034\305\267=R\206S>\214\377\n\276_n7\276\300\254a=\370N&=\260.\\>\"\377]> v\304=v\235\007>\254s\320=H\257\210\274\240_V\276dc\265\275\216aB\276\336\245\">\351\206\367\275\212\2144\276\000@\360\274\372\272\033>\210;\310=|\204\247=\300\361^\274\205UQ\276(\265\007\276\246\246A\276\212\241\210\275\246\332\035>*\322\027\2760\264k\275\224\276`>\300P\035>l{\246=\244v\021>\240\033:\275\024\333\365\275L\\\347=x\000w=\244\016\216\275~\2470>\360\'#\276`z\232\273\224\0379>\214X\223=\205\2633\276h\016\025=\010\003\003\275D)\275=L\367\000>\362\016\"\276\032\322\226\275\364G>>(\370&\2760\232O\275\202\177\230\275\254\017`\275\030\036\374\274\252y\003>b\025\017>\214\032\244\275\270;\325<{mT\2768\363\254\275\0300\253\274P\365\004\274X#\'=`\022I<X3\210\275\316\341$>\"\007\226\275\314\3236>\364)\007>\000\337\241\273\360\347\250\2750\365\014>\3000!;\344\022\371\275\274\003\370=\2702\215<\002\270[>}/a\276\270H_=c<Q\276*\354\313\2750\035\264\274r\006:>\016g\276\275N\373\004\276@Do\274\240\320\337\274\361\2065\276\240\226\317;\034%\363=V\007\305\275j\3275\276\222\004\"\276\\\227\331=0Z_\274\264\026&>\320|\245\274\200F\217;\370L>>x\312\225=\242\024\"\276P7)=`1\321\273\274\236\026\276\022\020E>$>\321=\240*\301\275r>L\276\014\332\301=\322\022E\276\240\n9=\336\031\017\276\340\n\031=\230\2056=\264\241\337=\330\313\210\275\200\222A\273Fx\365\2758\372\224<0\336[<\332}G>p\264\\>\324\362\"\275\376B\302\275x0\356\274df\027\276\2534\322\275\253E\025\276\371G\024\276\250\3472>\370\250w=,\256\275\275f\256a\276\300\306\307=^\306\r\276\022\240b\276\331\235_\276\314\236\222=Hz==@\244*;\256\301[\276\314\350\224=\315\026C\276\340\022\370<P\300\317<t-\036\276\240\321\316\273\377\0353\276\026\223>>\310\253\264\275\010u\311=\204JF\276\\\244\220=\033KZ\276 P\332\2740M\\=\350\340\200\274\244\324\006>.\3674>\000\234$\276v\r$>\254\346!\276,(\024\276\304\3705\275l\362O>l\\#>\260\367\220\274\217\360\374\275Z\353\262\2754{\265\275 \340\375=\000\266\327\272\324oS\275\020\2259\276\030,\226<\242\200\r>R\222\020>\370\n\236<\376qR>dqb\275\340\3451>\310\361\377=\030BJ>@\352\353=y\037N\276 -\340=Nl%\276\340Z\031\276\034\265 \276\004\016\324\275V\251M\276\304\223C>^\354\300\275\300\330\025>rIM>\3203\021>\330F*>\340A\271;9\010a\276"
  }
  initializer {
    dims: 80
    dims: 20
    data_type: FLOAT
    name: "2"
    raw_data: "\250\314\013>\277\352@\276`\341l=F\023\277\275\230\251\022>N\310\030>\200\346>\274\020\201\237\275H41>\210 \220\275\224K0\276\220\010\024\276\347%[\276\214e)>\242\000,>\224.i\275\354\t\312=\340^\002>\232L\270\275xr\033=\\\344\033\275\326e\334\275\222I\020\276\320Y\341\275\300\002\211\274\210\005\334\274J\225-\276\306\020P\2760D\371\274\250\277\261=x&\230=\344V \276$\376\366=\374M\036\276\020\216\336\275\004\300:>\320`e=\254L\247=F\205\\\276\255!G\276p\245*\275n\030S>\212\335a\276\\\343\374=\312\304\327\275\370\215#\276\016_1>\312\354-\276\014\024\246=D\022i\2754\216#>\2311Y\276,\333\357=\206\337\r>\270NV=\316\nH>^\246>>L\242\373=\n\002\037>\030ZC>\352\207.>\300\262\341=\352\036\034\276p\313\367=`\330\346\273\300@\275=\000\260\007\272\030s\376=xWM\276\342\301\025\276N\362\232\275\352\311C>\226\256\023\276\360\300c\274\224\017\225\275\261\341X\276\264\206L\276c\241;\276\234\327B\276C\2008\276\274g\021\275\340\\S>\360b\367\275\020\034\241\275\276\246\301\2750OK=ZY\n>\315\301\321\275\331\362\324\275\014\353\225=\266\357U\276p\277\007>F\320\260\275\200+\316=\026)1>\260KL=\035\033_\276hG\206\275\210YC>\337>S\276:\035?>\002\'.\276\370\021G\2756\375\037>\354#X\276\234HS\276\37468\275\343\263)\276\340\361\224\274\314\177\025>\324\035\350=\316gP\276\330\035p\275\303\215-\276w\241\021\276\274\372\326=\0001<=d\303Y>\334\262\251=\342{\"\276\030!z=V\353\027\276{-X\276\030\tC\276\030FX>\265\223\336\275\316B/>\223\353\027\276\300\266N>!\357\007\276\344\326\202=\034\226d\276\244\004\276\275\376H\201\275(\255\216\274\346\"\307\275X\254U\275\250\264\256\274\336\300\036>\211 Y\276U\032*\276\000\177\245=8{\014\275\350\330N\275\220i*\274\026\363P>\364\221[\276<\244(>\260X\314=\367\037\007\276\270W;\275\034\255\210\275\366.\233\275\346?\014\276vm:>\264\244W> \201P=xX\364=\340\2208>\210\335\340=\220\224c>\264D\305=\222\212c\276\206\350d> 2\250<\270\301\330\275\020B)=\037p\023\276\234i\303\275P\232\027=\302.\220\275\'B+\276\260\260\034\274\364\244V>\000\2436\272\300j\334<\200\274z\273Ym\014\276\320\327\357<\004\032%\276\240\226\307=\274\343Z>F3]>\000\254N\275\366\006L\276\250c\033=\262s*>Pu\'=\206_[\276n]\\>\361\345U\276\350mB=\212NY>\215\264\357\275\210\276R\275x\2620=t!p\275\330\210\352=\220\253^=\220!H\274\200\314\335\273\334K\262\275\330\202\000\275j\217\"\276zGc>\350\300\316\274\270\211\232=T\312\255=\244\350\026>\362o\205\275\226i4\276\300\352\355\274B\035@\276v\247\217\275`\036\351\275\333Bc\276lY\303=\254\361`>\200\024\252;\026\2405>Nw\027>\266q<>\240\240\327<<P\024>\200~)\276\024\205Y\276\340\214\227=\2247\324\275\320\035a> \316\000=F\212\223\275\016\177G>\236X[>\006\000*>\242\347\014>>\035\203\275X&\375=\340\"\210=\024\360\254\275R+\"\276\304\316d>\326\261I\276\270\216O=<\305\336\275\261\335B\276\002\004\324\275\276\277\261\275\346\247\003>p4;\274\260lV>\020\2476=\000\021\037:\3740\021>\220\233\360\274\264>\356=t;\220= \202\301\273\214\206!\276\264\005%>5\244&\276H\370\257=_Ya\276H<\274<\300\235\017<X\010\265=Z\016\021\276@q<\276\222\354\214\275\220\212\334\275FkT\276^\010&>\220U\302<\344\321\324=8\033\335=j\342\270\275\264}\243\275hO(\276\230\014=>p<\r>\350\221;\275tGz\275\022(<>\374\351u\275\274l\242\275H\351\201=\352c\253\275\000\217B:j\222->\005A+\2766\303\t>$o\000\276\2609P\275\264\"\343=\240\333==\246I\017>\374-X\275\016\2156>p\035 \276d\354\210=6\273\344\275\224\033\270\275@\362\031>\021v_\276tS\353=P3\217=~!\207\275\310\275\376=\306I4>l^\017\276p\030\023>\010\300\023\276\335k\346\2756\336+>p&\014>\324\306\314=\2764Q\276\344F\345=\240\033\253=\240C\207=\314\016\353=\320N\336=\002\337>>H\225\004=\030\205\273\274\000c\003=\334\032*\275\n\2675>\2201\\\275w\217\n\276`\310\304;\256\235\263\275LMA>4\213V>&XV\2764\323\357=K\302\021\276`\023\240=\013\301@\276$/L>R\250?\276\343\204-\276\276\252\r>\240q\r<\260\2273\275P\316\035>\220\367\306\275\206\177\325\275Xb[\275\014\305\033>\007N=\276\344\315\262\275\035U\365\275t\316D>\377\236&\276\244\322\353=\344\000\023>!\366\371\275X\341\204\275\340\247\020>D5Y\276\030\245\236=` >>\306\315\021\276\020o\220<d\212\245=\376G\251\275\302\234H>\310sJ\275\364\250\202=\314`\314=\327\\\365\275\300e\215\275\200BJ\274\\BI>n\004,\276<\026\347=\236\303?>\020\3008=R\'\n\276\322\322\t>\206NA\276\274\220\210=\212\223\203\275\260\332\026\275N\3750\276(\031,=\340\212\r\276\320\276V>\340|\026=X1@\276+\204\356\275\354\000\032>\340t\026>$ \304\275\010&\211=p\177\320=z\237M\276\020Y\330=\217\251\026\276\2144t\275\250@\260<\270\027\022>`\202$\276\252\375\031>H\334\337=\244\215Z>\010\002\351\274@\'O\274\022\013\024>}\003S\276\"f\365\275\306\301\233\275\027US\276\370\020\317\275(\372B\276\203OU\276t|\001\275V\016X>\000\332,=\275\266O\276(\334o=0\340\035>\320\324\033\276\334\331\000>pE\311=\220;C=\010\377\225=\240b\327\274j\3343\276\340\363\210\274\346\003\035>\200\010\033<\250z\351\274\305t#\276\370\3765\276\200w\243:8\277\225=\006\246*>\020\226K\274\214\226\262=\244\342\030\276\313\347`\276LV\r\276\300\240)>l\201\363\275|\227\311\275\300\223\351;\216\200\324\275\210\220\354\274\033\225\022\276$\350\023\276\026)Z>#\014Z\276`-Z\274\0144\323=\030\225\367\275(\266\272=\010[\206<\270\035B>t<B>\200-\303:\t,\r\276\324G7\275xv\347=\202\2475>\310\325\270<\247\007\333\275\214\247\352=\212{M\276\256\224H\2762\254\231\275\211b\343\275\357\261B\276<\210\306=0\262I>\210[\321\274\210Z\204=\222\2449>\332C\023\276\234r\233=b\032\'\276(R\323<\010\261\247\2740\263\010\275\354J&>lN\203=\237wI\276,\203\246\275\226\213\211\275\2564]\276\274\000\331=\03042=-\341*\276\364\026\227=\272\020/\276t\2152>\217,\377\275\364\252P>\220:\006=\250\324,\276\224\246\010\276\240\302\222=\352\210K>\220\257\001>8;o=\300\245\330=\312\275\'>\006^M>\372-a\276\000\010\1779\316\356\020\276\212\371\265\275\360\304b\276)@:\276^\027\023>\350\037\002\275\374\253\350=\203\231?\276\370\235\331\274V\277\">&\000\020>\360\246N>\272\014H>\026\277Q\276\304N\247\275R\3229\276\206\3022>\300\210\370\274\250\345\000\275\030\316\232=\024z\204=0\306#>\2243{\275i\375\002\276L\257\327=\206\314\'\276\364\007\014>@\031O\275p\033\347=\3548 \276\3126 \276\344\300\221\275\030(\202<\304\302\213\275ze\032>h\200\243=\0007\217=d\267\022>POL\276\354\322\335=\375\363\376\275\352\305K>\216\001\002>\250\377\301=N\0371>\200\223\t\275\332/\032\276\260\345 <\024\215\354=\200\036\002>l\225>\276\200\336\376\274\200\201q;\354K\252\275\330\245\027\276A/=\276\3404\306;\01473\276\350\325\231=\000\263\001;\240\201\357<@\270\324\273\304\210\253=x\340p=P5\336<\272#+>\376\277*>Zn\243\275D\343G>\261\377c\276\000\350_:F\365E>p\306R>\314q\r>`\"d=V\234\013\276\260\023\023\276@\357\013=\346%&>\360\031\260<\036/\020>\276\2777>\242e@>\023\344\313\275xS\313\275\000\234B>x\366 =\014FE>\"\355R>!\253Z\2764\024\\>\300~\342<[\336\331\275\320\005\370=\373\253,\276\270\377\210\275V\230\035>D$:>\266HI\276\342\267\322\275lNq\275\345\370\005\276(C\344=\300\357$=(J\\=\266\212(>0\373\262\275p\217\346=\220\362#=\236e*\2767n\370\275.t\r\276\206R\001>[\231\017\276\206\310X\276\200\\,\275 \232\016\276\\\027\262\2758\266D\276x\024[>b\370X>\370\3175\276T\243\036\276\3404\201\274\200\2100\276\334[\266\275\211\205\n\276\272\366\254\275\002\240d>h4=>s\316P\276X\233a\2768\226\005\276\320\203\366=\330\231\"\276\370\027)>\000,\037:\314R\332=$\333\332=\206V+>\030\305\377=6fY>p\335=\275\317\310\372\275\340\363\232=\232J8>\214\342\216\275\322\334Z>\350?>>h\313\250=\204\217G>\300zl;\\\t\340=&rX\276Xts=\030\272\202= \'\242=\254;\247=dx\301\275\206~\037>07`>\337?\"\276@\013\251\275\250\n}=\214u\216=p\010\000\276\310\035\245\274\210SS\276R\0041\276\272\345\034>\242\331!>lx\005>\244\2471\275\216\363\022>2r\223\275\350Yl=\230\273&>T\265\017> 0\274<L\222;\275\000\374]\273\304\306\310=6\262\024>\342\314b\276\270\323\271\274\370_>\276\260\002\233\275x\307^=/7\035\276<\332\244\275\363TJ\276\234<\246=\2103m=\020\221A<t\331\244=\270i\260=\004\224~\2756\227\025>\t\243d\276\357\210G\276\224\022,\276\020\257Q<\236CJ\2760\362\202<\200\017B\273\354\024R\276\374\316`>\010\001V\275F\242$>8\327I>\256\\\263\275\314\366\206\2756\316`>\250\220\316<\320\260D>\220\233y=\354\372\370=Z<F\276\030\2104\275ji >0\302K\274S\352F\276\020K\277<\230n\252<\230N\253\274T\362\355=\200\035\262=\037\001\347\275(\344\"\275\026\332\014\276\004\341\330=`U\006\276\305q\361\275@4\261\273\254\020\032>8\354+>\322\351F\276Y\324]\276f\340->\207\360\343\275\370uT\276\300+\212\274t\375&>X\200\352\274\010\'L=>\327^\276\264\202<>J\250\023>(J\037>\360\357\355=r=\352\275.\352?\276\000\317_:\340\234\365=\2700\307\275\230\004c=\330w\220\274(I\252\274@Ul=\214\037\'>\370\225?=\230\317\203<\330H\024=h\203(=\"l\224\2758\343\320\274\0209_=\332`4\276\000\360\0329\020\304S\276B|S\276\200V\204;\300\305\376<\020\336,=\002\017\251\275\230\025\311\274h\003\313\274\300@\364\273\036\372\023\276\230\354G=\344\337\215=\240\t\321;\230\251\224\274 \276\335=\304\374\032>@\2577\273^\307-\276\014q\037\276\000\017\217\2730KQ\276\344\035-\276\340\026^\275\\!\267\275P\025\353\274\360M]=\246\273\034>l\343c>\024%\267\275\317\266_\276*\007\030>f{G>,xZ>\230\274O=|\345\021>\000\272\n:\363E\"\276\231>8\276\334X\t\276(\321\n=\264\373g\275\3702j=\370\367\240=@\035\021\276h\026\222<\316\336]>\254\326\026>\320\375\313\274dj?\275P\272\262\275\270\022\226=20\n\276\304\314b>\000\374N;\205\362\023\27647\336\275\300]\260\275\263\3165\276\320#\217\275A\322[\276X\t\233=d%\225\275P\226^=pL\340\27540\317\275\354\331\337\275\200F\002\273+M.\276,\240K\2768w==\017\360D\276\252T9>\244\312,>\224g\003>\3140\032>\023\027\006\276\360!\n=\200jE=F\252G>\300\217N\276\310\257\203\275`\365\347=\3249\363=\351\331]\276\000\324R>\244\274\027>\222-B>V\374\247\275\271\205\350\275\230\374z=\216\341\'>:8G>9`\026\276TN\022>l\325\022\275\"\205\327\275\276\214\006>$\225\326=`vM=\245\325\017\276\342$W>\030\224\036\275 \336\336;D\310\220\275okA\276\364X$\275\000P5=\270\376\220<\370OV\275\326\260 >\000\330\005\275n\210.\276\004\246\267\275\204\002Z\275\320X\026>\366\3372>\000\304\236=X\004]>,\263Z>\200\013O=\032\365\034>\274x\305=`\203\004=V\232P>t\026l\275Z\0056\276\246\\J\276\316N\r>\275\340 \276\004\257\304= \301P\274\016\274W\276\360\230\223\275\370R\244=\00099:\330+\262=\346\356\260\275\224\231\320\275\330\323\205\274\332\265I\276\210\202:\2750HJ<\214\013\272=*\301\215\275\236\252\020>\340*\272\273H\017m\275\374\204\177\275l\214\035>0\312\\<\361\312\000\276\264m\004\276\000\315P\272\010\272U=\200\273\014\276\207tO\2760y\274=@{\212=\352\030\000\276\320\377\370\275\266\3461>\0246\026\276\304\346 >\330\346\020\276x4\256=p&;\274\234}\254=Lb\314=H\354\307\275d\235J\276\200mj\273\370\033\034=(\250\315\274\030\224\246=\004\216b>\266V\273\275\324=\227=\200\370\217= \343\002>(\r\303\275\036\300]\276\026\303\005\276\320\270x<\342\035c\276\276\371@>.\\8>\220\322V=\317\215%\276\257\325Y\276\366\302\007>\3706\027\276@\252\233=h\013Y>\0064\003\276\310\240\255=\260\335>\274Lc\260=X\330\331=\200\213\236\2730\022\"=\014-E\275P&w= \002V=\020\035\020>:\226H> \250x=PA2>!M`\276\220#\314\275\001\356K\276^u\272\275\nu0>\226TJ\276,\237\003>\334\272\215\275\340`2<P\375\024\276t\037\000\276\350\370\244<\360\305\264<e~@\276\200>\334\273\006p\256\275$\367\034\276\004\314<\276\020\027\200=\340Y\355<\230w\005>6\2151>T\034\245=:\260\226\275`\025\016>\004\023\216=\350,+>\310\241\362=\020$R=L\000\342=g(a\276\334\246\355=\246\365\030>\370z\364\274\005\212F\276\246(\022>\360N;<f&\200\275\310\356\014\275\276W2>j\327\230\275\022\024a>\314\266$>TQ\255=\374\273\360=z\376\027\276\372X<\276\312\266&>\344\257\022>\016 0\276\346\370\013\276\314\300\276=\300_\226=\224=\020>/S\036\276\240\202\342=\270c\230<eT.\276z;c>P`(\275\322q\310\275|4<\276\230\373\234\275\336\303\336\275\000\n\005\274w\263(\276\222]U\276d\265X\276jB\001\276\242\201\247\275p \354<0\211_=2\350\010>\320\360\026\276\214\205\022>\014H\r>\222\205<\276\376\273\031\276\241\003\371\275@\215+\274\265\332V\276\370:\005=\274\320\272=.0$>\266\260\r>\374I\345\275\022\004\030\276\334\252\t>\000\'\231\274l\022\006\276\370\002\t><\205\342=\0165\002>\302:\322\275\004%\022\275\370b\n>\236\202c\276SNY\276\365\255\034\276\260\362\327=\225qX\276\350\341\272==7\021\276\0325\225\2756r\232\275\004\267\010>\030\331A>\014\303\007>rJ\033\276\010y\315\274\004\376\364=\372E\001>\024O\321\275\220\036\340=\000P\006\274\004k2\276t\351\320=\300?\225;\034\360\317=\356\241\'>\364\000\t>\370\000V=\240D\177\274\024pF\275\374\312\034\276\337\025 \276\226\235_>4\022\035\275\020\013\332=\320\0343\275\010$\027>\254\333Y\275\026.\032\276~Z*>!\021\333\275\200\206d=\214\027=\275\320\236d>\250\032;=\000/]\275\\X\214=&\0270>\2005\031\276\330C\r>\n<d>zf\303\275\222\014\207\275\374\331&\275(\260\274<\211\310\346\275Y\014K\276\010.\261=\0208&=O\031\334\275\274\323\233=\024\241\017>Ph\320< \271\r<4\t\275=WhJ\276V\276\033\276\210P[=\334\201\375\275\022\316T>x\253\223\275d\2519\276\342E\350\275\240\350\304\274\203\252\334\275\264\266\271=\000\250\342<,\336 \276\350\003(=\260\370$>\240\t\357;\325\316\\\276\350i\272=\302\216`\276\322G\230\275d\222\250=g\215R\2760\326\206=0\002\366=<XD>\354\'\246=p\277\241\274\370\253\250=xh\014\276|\313(\275}\326\021\276\036\026\244\275\372\004N\276;J\377\275\230\317\250\2740\017[=\016[\005\276>\271L>x0\026>\200\2245>\330\022\264\274\024bR\275}\003\032\276\252\241\237\275d\317\027\275\270 \252=\022\202\241\275|m+>J\230\006>D))>\334\332\266=\277:F\276\004bL>\200\330K\273<>Y>*\357T>\240\177!=\030\312\322=\034\332\002\2766\302P>\\\250D\276\262\277\032>\270;\252\275\350v]>\000\324\2739\261\230\371\275\004\265\275=\300\274\000=\224\032\373=\270\305\t\276+0\314\275\240\307\347\273|]~\275(\356\036>4\234\244=X\244D\275X\373\377=\370\326^>\372j\333\275^#\026>T\200\020\276\306\t\032\276\211\272T\2760\234\367<\354;1>yQ[\276a\207,\276`G\013>\377\311\342\2758*\346=\350/\033\275\216\222#>\330\003\007=pd*>Db\301\275l\326\240\275\340.\267\275\214\322.>\360?\254<\200c!\276\010\315\367=\026b\017>)r\016\276\260\336/<%\244[\276p\003\351<$\034\241=\004\353L>\016o\224\275D-\245=\\t\231\275\254\t\241\2752\344J\276 RA=8\244\031>\017\301\376\275\2249\273=\000\336\016\275`\221\"\276HR\303<}\"_\276X}\365=\244^J\275 \341R>\200>\007<\317\374]\276\270\2571>\234UH\275\244\327\034\276\250hS>\300\025\253<\334x\224=\361\024F\276t\273\241\275\222\2677>\\\302\033\276\314\3708\276(\2533>\034\360\035\275\220R\213\274\330g\">|\210\217=M/\352\275Pea\275\366\273\023>`@\223\275n-7>>\310P>bR\t>\250h\232\274\0246\313\275i,\373\275\355\3259\276\000\205\262:\256C\024>\224\362\271=\360uO<\300\344V\276\230\263\332=\260\366S\275\360\352\016=\033\224\n\276\310\014\005=x\277`=\300\331i\275N\210\240\275\364\313\212=\010T\003=\342\266\036>\3126+\276\244\205`>\214\376T\276\325w(\276\260\177!\275\344\340F\276\350r\032>\220e \2750\016\016<\2447\224=\220,\317<\206lC>zS$>\270\327\233=a\251[\276\0108\254=\374!\027\275\330\256\033= \220/>\313\357\327\275\200\251i\274+:=\276\034\004\246=\264\177H\275\n\371\250\275\020\037J<PC,<\010\324&=dYT>\276\t+>h6=>\215\326\002\276\301\310X\276\276\347&>\3364E>\\\351\t>*>-\276\352\247\257\275P9S>\264C\350\2754^\035\276\240\001\037=|\0268>\350k\260\2756D\216\275\034\247\235\275\224\231\356\275\000&I;X\375\322\274\030\313\276=\351\203*\276r\206\203\275\350\305R\276}\031d\276\210s}=\310\301\354\274q\352M\276\200\316\334\273\014c\213=XD&>\316\253\t>O\355Y\276\030\025v=\261qW\276\326\255)>\222@\025>\206&S\276\000m\313:\024\256\216=Pi\026<\314\265N\276\034eV>\341\203\341\275<b\216=\n1\017>3fQ\276\"\263\207\275\033\252\323\275\000P`>\360\244\271\275x~B\276\3360O\276\240\021\274\274x^H>\251\3475\276\231a\n\276\247<N\276zO\\>\030\365\366=l.\300=8\2654>|l\212=:\347\030>0\004P\275\200\231\r=?\\\372\275\0143[\275\220\334\263<\332]\321\275\224\000\357\275\260k\245\275\320|\016>h\240\345=\372\034\233\275\200\n\211<\350i\305\275\224i\036>\235\206\375\275\322\230\005\276X\"\021>\322O3\276\202\022\235\275\364\023\310=x\374{\275\316v\257\275\352C2><W\026\275N\037Y>\370\235n\275x]\356\275\332>4>\\\347\"\276\341t&\276\360i\360=M:\032\276\004T\226=\322 \037\276\202,]>\250\212+=\240\251<>\344N^\276\240Cr=@[<\274@\362\341=>N\205\275\202\261d>r\200\\>8\274\333=O\313\006\276\324\\+>\352\241^\276\030\"\365=\210=\343=h_\353=l1\203=\200?<>\343B\374\275\216\371\'>\344\224\263=\200\'\300;@3\265=\020t\251\274\370\3138>\300]\200;\364,\377=\252\tL>D\224\224=\300\'\312;X\177\200\274\032\224:\276\220\3402\276\250\311\230=\270:\252<\010;m=>\325N\276\3422\000>\350y\275\274\230U\262=\204\215\374\2758U?=$\266\353=x++\276\250Q\243<\216\213\236\275*\371;>\370\312?\275\246\363\005\276b\264\022\276\030\351\246\274L\377\317=\330\363\232=\374\035P>\266K1>@\001\027=\240\232|=\2206\306\275|\253\240=^\302/>`\326\225\273xd0=\3146<\276\332l\000>\014dA>b\344R>tG\300=HU\260\275\360\206%<D\030\302\275\217o\332\275\030vS>p\315$<\354\325 \276p\234\n\275\240K\326=p\026\022\275v\023\027>\374\216\351=F\374W\276\324\177\224\275\010\2765=,2X\275R7\032>\224\312\315=\322\004\031\276`\211\020=>\276\007\276\301\001B\276q\007V\276\200N#\273\3502\177=,\257\212\275\220<(\275rMG>\332\034]>(5\022\275P\331\215\275\370jV>\350#\311\274\232G[>\034\250\017>\230\357\326=\200\351\206\272\340\307\301=\000\364\323\273n79>\030\230\034=,\340*>\006\222%\276V\271\037>\310\367\333=\255O\036\276xP\325=8\362^=r\221\320\275\370:>\276\300e\345<\2403\246<\255T\345\275\014\304,\276\226\000\250\275\020\317P=B2/>P\312\'>1\304\312\275\206K[>\372\264\000\276\362\013T\276\266\302B\276\330\202\235=g\001\367\275,\340\002>\346~\027\276\340-\360\274p\323T\276lb\331=\200\247\274\2748\302\002>\333\3004\2768\262\315<Z\247F>\020\212\233<e\210\006\276\342\232\001\276\241\254L\276\330E\036=f\264\027>\234\246\234=\240I\236=\'\010&\276\000\253\204:\300B\327\275\017<U\276\234[\300=h\006c>\340\223\210\273F\375H>"
  }
  initializer {
    dims: 80
    data_type: FLOAT
    name: "3"
    raw_data: "t\204\000>\232\217\243\275\\$\'\2754\273?\276\317\036 \276I\2315\276\220\021V\274\234\323\227=8\360(>\350M\260<`M\354=\256\nV>\210\036_>\314O\002>b\002\000>\014\260\352=\240&\320;Hr\337\275\016\306\022\276\2662\025\276v\257b>\034\326\326=D\262P\275\226\006\272\275Dz\363=0\342\351\274\310\357`\276\242\223U>`f\361<b\367\241\275\274\365\204=Xm\262<>F\327\275\320\303\244=\256\304\006>@\253\n\274t\314\205\275\240\353Q=l\\\347\275\3442K>\320\"\327=\376\326\302\2756\323\251\275p@[>\272R\\>\210Z\217=\344xP\276\000o-\275\360\334\373<\2744/>H\344E>\220Ot=\226)Y>\370\345M>\200\021\003>\n\t\036>&\324!\276\230\201d=\314\324\273\275\232Z(>\353Ha\276\354w@\275Ss\r\276\320x\223=L\377\370=\320\227\354=*@a>\232] \276X[\322<\256\\\235\275\270\366\267=`8O\274\337t\323\275\352<\000\276\360,\376<\315G\362\275\334t*\276<i&>\027X.\276_\256U\276"
  }
  initializer {
    dims: 80
    data_type: FLOAT
    name: "4"
    raw_data: "#\206@\276.\274\013\276\246\200N\276\000\3700\273\216\216\025\276P\251\212\274D\3617\276 K\"<\344\256\003\276\330\206\251=\354\264[>\254d\342\275t\322J\275VBU> D\232=\340\211\n\276\024Z`\275\270*4\276\016\367\037>\330\370\026\275(P\327=\006\277X>\016\254\277\275\311OC\276$\205>>\250\2036>\242\274]>\240\342\001>T{\230\275L\r)>\224\303\004>0\255\207<TDB>\304\304\246=\314\215E\276\254}\031>f\356\350\275\020t\003\276\n\207\021\276X\235\250<\330=\255<\3408\201\275\266\3737\276(a\250=0\227\365=\2408\311<\300\247C\275\034D\335=\220M\006\276\000E\030>\260\tO>8\354\031\276\224\260\'>\354WD\276\000d\313\272\210\244\234=\250\244\023\276\354\365\007>\030\\\325\274\020\261\307=\234\331\201\275~yG>\254^\232\275\374G;\275\230\3371\276q\024\036\276\336d(>\334\310\312=\360_\225\274\244\361\206=XE\252<\204\310\022\276|\332\216\275\001hd\276\221\312Q\276\360\3668>\364#b\276V\031\t>\202U\007><JV\275"
  }
  initializer {
    dims: 80
    dims: 20
    data_type: FLOAT
    name: "5"
