graph torch-jit-export (
  %0[FLOAT, 64x100x1x1]
  %1[FLOAT, 100x512x4x4]
  %2[FLOAT, 512]
  %3[FLOAT, 512]
  %4[FLOAT, 512]
  %5[FLOAT, 512]
  %6[FLOAT, 512x256x4x4]
  %7[FLOAT, 256]
  %8[FLOAT, 256]
  %9[FLOAT, 256]
  %10[FLOAT, 256]
  %11[FLOAT, 256x128x4x4]
  %12[FLOAT, 128]
  %13[FLOAT, 128]
  %14[FLOAT, 128]
  %15[FLOAT, 128]
  %16[FLOAT, 128x64x4x4]
  %17[FLOAT, 64]
  %18[FLOAT, 64]
  %19[FLOAT, 64]
  %20[FLOAT, 64]
  %21[FLOAT, 64x3x4x4]
) {
  %22 = Constant[value = <Tensor>]()
  %23 = ConvTranspose[dilations = [1, 1], group = 1, kernel_shape = [4, 4], pads = [0, 0, 0, 0], strides = [1, 1]](%0, %1, %22)
  %24 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 0.899999976158142](%23, %2, %3, %4, %5)
  %25 = Relu(%24)
  %26 = Constant[value = <Tensor>]()
  %27 = ConvTranspose[dilations = [1, 1], group = 1, kernel_shape = [4, 4], pads = [1, 1, 1, 1], strides = [2, 2]](%25, %6, %26)
  %28 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 0.899999976158142](%27, %7, %8, %9, %10)
  %29 = Relu(%28)
  %30 = Constant[value = <Tensor>]()
  %31 = ConvTranspose[dilations = [1, 1], group = 1, kernel_shape = [4, 4], pads = [1, 1, 1, 1], strides = [2, 2]](%29, %11, %30)
  %32 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 0.899999976158142](%31, %12, %13, %14, %15)
  %33 = Relu(%32)
  %34 = Constant[value = <Tensor>]()
  %35 = ConvTranspose[dilations = [1, 1], group = 1, kernel_shape = [4, 4], pads = [1, 1, 1, 1], strides = [2, 2]](%33, %16, %34)
  %36 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 0.899999976158142](%35, %17, %18, %19, %20)
  %37 = Relu(%36)
  %38 = Constant[value = <Tensor>]()
  %39 = ConvTranspose[dilations = [1, 1], group = 1, kernel_shape = [4, 4], pads = [1, 1, 1, 1], strides = [2, 2]](%37, %21, %38)
  %40 = Tanh(%39)
  return %40
}